import pandas as pd

path = '/Users/chandler/Documents/Projects/sndataclean/cao_biao/fff.xlsx'
# 读取文件路径至pandas转换为dataframe

read_df = pd.read_excel(path, sheetname='Sheet1')
# print(read_df)
# 选取excel表中需要的字段

#
# print(read_df)
l=[
'2018-06-01 00:00:00 6.1 6.10 6月1日 6月01日 2018/6.1 2018-6.1',
'2018-06-02 00:00:00 6.2 6.20 6月2日 6月02日 2018/6.2 2018-6.2',
'2018-06-03 00:00:00 6.3 6.30 6月3日 6月03日 2018/6.3 2018-6.3',
'2018-06-04 00:00:00 6.4 6.50 6月4日 6月04日 2018/6.4 2018-6.4',
'2018-06-05 00:00:00 6.5 6.60 6月5日 6月05日 2018/6.5 2018-6.5',
'2018-06-06 00:00:00 6.6 6.70 6月6日 6月06日 2018/6.6 2018-6.6',
'2018-06-07 00:00:00 6.7 6.80 6月7日 6月07日 2018/6.7 2018-6.7',
'2018-06-08 00:00:00 6.8 6.90 6月8日 6月08日 2018/6.8 2018-6.8',
'2018-06-09 00:00:00 6.90 6/10 6月9日 6月09日 2018/6.9 2018-6.09',
'2018-06-10 00:00:00 6.10 6/11 6月10日 6月10日 2018/6.10 2018-6.10',
'2018-06-11 00:00:00 6.11 6/12 6月11日 6月11日 2018/6.11 2018-6.11',
'2018-06-12 00:00:00 6.12 6/13 6月12日 6月12日 2018/6.12 2018-6.12',
'2018-06-13 00:00:00 6.13 6/14 6月13日 6月13日 2018/6.13 2018-6.13',
'2018-06-14 00:00:00 6.14 6/15 6月14日 6月14日 2018/6.14 2018-6.14',
'2018-06-15 00:00:00 6.15 6/15 6月15日 6月15日 2018/6.15 2018-6.15',
'2018-06-16 00:00:00 6.16 6/15 6月16日 6月16日 2018/6.16 2018-6.16',
'2018-06-17 00:00:00 6.17 6/15 6月17日 6月17日 2018/6.17 2018-6.17',
'2018-06-18 00:00:00 6.18 6/15 6月18日 6月18日 2018/6.18 2018-6.18',
'2018-06-19 00:00:00 6.19 6/15 6月19日 6月19日 2018/6.19 2018-6.19',
'2018-06-20 00:00:00 6.20 6/15 6月20日 6月20日 2018/6.20 2018-6.20',
]
f = ['短信', '短信/站内信','站内信', 'push/站内信', 'push',  'push精推', 'push+消息中心', '邮件', 'push普推', 'push、短信、站内信', '短信、站内信']
for j in l:
    count = 0
    for k in f:
        for i in read_df.index:
            # print(str(read_df['日期'].iloc[i]), str(read_df['渠道'].iloc[i]), str(read_df['发送量'].iloc[i]))
            if str(read_df['日期'].iloc[i]) in j and str(read_df['渠道'].iloc[i]) == k:
                # print(str(read_df['发送量'].iloc[i]))
                # if read_df['发送量'].iloc[i] == int:
                count += read_df['发送量'].iloc[i]/10000
        print(j[0:10], '{0}: '.format(k), count)

# count = 0
# for i in read_df.index:
#     if str(read_df['日期'].iloc[i]) in '2018-06-02 00:00:00 6.2 6.20 6月2日 6月02日 2018/6.2 2018-6.2' and\
#                     str(read_df['渠道'].iloc[i]) in '短信/站内信':
#         count+=1
# print('6/2 短信: ', count)




# df = read_df[['推送类型', '渠道', '活动归属名称', '计划发送会员数', '买家数2', '买家数4', '打开会员数', 'UV']]
#
# # 循环遍历df的所有索引
# for i in df.index:
#     # 判断如果是短信渠道就要删除'买家数4', '打开会员数', 'UV'这三个列的所有数据并赋值为0
#     if df['渠道'].iloc[i] == '短信':
#         df['打开会员数'].iat[i] = 0
#         df['UV'].iat[i] = 0
#         df['买家数4'].iat[i] = 0
#     # 否则就要删除'计划发送会员数', '买家数2'这二个列的所有数据并赋值为0
#     if df['渠道'].iloc[i] != '短信':
#         df['计划发送会员数'].iat[i] = 0
#         df['买家数2'].iat[i] = 0
#
# # 整个df只要活动归属名称在act_belongto_name这个列表中的所有数据
# df = df[df['活动归属名称'].isin(act_belongto_name)]
# # 对处理后的dataframe重新索引（删除一些数据，索引可能出错，比如出现0，1，2，3，12，13这样的断点）
# df = df.reset_index(drop=True)
# # 将处理好的数据导出为excel格式文件
# df.to_excel(os.path.dirname(self.path) + '/clean_data.xlsx')
# # 返回并调用pivot_baibiao函数生成数据透视表
